var langMap = {0: 'ru', 1: 'uk', 2: 'be-tarask', 3: 'en-us', 97: 'kk', 114: 'be', 100: 'ru-petr1708', 777: 'ru-ussr'};

var i18n = {
    answers: {
        0: 'Ответы',
        1: 'Відповіді',
        2: 'Адказы',
        3: 'Feedback',
        97: 'Жауаптарым',
        114: 'Адказы',
        100: 'Отвѣты',
        777: 'Сводки'
    },
    edit: {
        0: 'ред.',
        1: 'ред.',
        2: 'рэд.',
        3: 'edit',
        97: 'өзгерту',
        114: 'рэд.',
        100: 'изм.',
        777: 'корр.'
    },
    people: {
        0: 'люди',
        1: 'люди',
        2: 'людзі',
        3: 'people',
        97: 'адамдар',
        114: 'людзі',
        100: 'персоны',
        777: 'граждане'
    },
    communities: {
        0: 'сообщества',
        1: 'спільноти',
        2: 'суполкі',
        3: 'communities',
        97: 'бірлестіктер',
        114: 'суполкі',
        100: 'общества',
        777: 'клубы'
    },
    music: {
        0: 'музыка',
        1: 'музика',
        2: 'музыка',
        3: 'music',
        97: 'музыка',
        114: 'музыка',
        100: 'патефонъ',
        777: 'патефон'
    },
    games: {
        0: 'игры',
        1: 'ігри',
        2: 'гульні',
        3: 'games',
        97: 'ойындар',
        114: 'гульні',
        100: 'потѣхи',
        777: 'отдых'
    },
    all_friends: {
        0: 'Все друзья',
        1: 'Усі друзі',
        2: 'Усе сябры',
        3: 'All friends',
        97: 'Барлық достар',
        114: 'Усе сябры',
        100: 'Всѣ знакомцы',
        777: 'Все товарищи'
    },
    settings: {
        0: 'Настройки',
        1: 'Налаштування',
        2: 'Налады',
        3: 'Settings',
        97: 'Баптаулар',
        114: 'Налады',
        100: 'Настройки',
        777: 'Настройки'
    },
    apps: {
        0: 'Приложения',
        1: 'Додатки',
        2: 'Праґрамы',
        3: 'Apps',
        97: 'Қосымшалар',
        114: 'Дадаткі',
        100: 'Аппликацiи',
        777: 'Досуг и отдых'
    },
    audios: {
        0: 'Аудиозаписи',
        1: 'Аудiозаписи',
        2: 'Аўдыёзапісы',
        3: 'Music',
        97: 'Аудиожазбалар',
        114: 'Аўдыязапісы',
        100: 'Композицiи',
        777: 'Грамзаписи'
    },
    videos: {
        0: 'Видеозаписи',
        1: 'Відеозаписи',
        2: 'Відэазапісы',
        3: 'Videos',
        97: 'Бейнежазбалар',
        114: 'Відэазапісы',
        100: 'Синематографъ',
        777: 'Киноленты'
    },
    groups: {
        0: 'Группы',
        1: 'Групи',
        2: 'Групы',
        3: 'Groups',
        97: 'Топтарым',
        114: 'Групы',
        100: 'Общества',
        777: 'Клубы'
    },
    spam: {
        0: 'Это спам',
        1: 'Це спам',
        2: 'Гэта спам',
        3: 'Spam',
        97: 'Бұл спам',
        114: 'Гэта спам',
        100: 'Сiе спамъ',
        777: 'Это провокация'
    },
    delete: {
        0: 'Удалить',
        1: 'Видалити',
        2: 'Выдаліць',
        3: 'Delete',
        97: 'Жою',
        114: 'Выдаліць',
        100: 'Сжечь',
        777: 'Сжечь'
    },
    messages: {
        0: 'Сообщения',
        1: 'Повідомлення',
        2: 'Паведамленьні',
        3: 'Messages',
        97: 'Хабарламалар',
        114: 'Паведамленні',
        100: 'Письма',
        777: 'Телеграммы'
    }
};